Tekla Open API Reference for Tekla Structures 2025
RebarLeg.OriginEnum Enumeration
 Enumerator for different leg origins.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum OriginEnum
Public Enumeration OriginEnum
Members
Member name | Value | Description
NORMAL | 0 |  The leg is from a face
HOOK | 1 |  The leg is on a hook.
CRANK | 2 |  The leg is on a crank.
See Also
Reference
Tekla.Structures.Model Namespace